arabic/arabic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-23 Sat 23:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><span class='hebrew'>לימוד ערבית</span></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mayer Goldberg (@@html:&lt;span class='hebrew'&gt;@@מֵאִיר גּוֹלְדְּבֵּרְג@@html:&lt;/span&gt;@@)" />
<meta name="keywords" content="Mayer Goldberg, Department of Computer Science, Ben-Gurion University, learning languages, arabic" />
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=David+Libre">
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Noto+Naskh+Arabic">
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Aref+Ruqaa">
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Amiri">
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Old+Standard+TT">
<link rel="stylesheet" type="text/css" href="https://mayer-goldberg.github.io/website/hebrew-support/gmayer-org-mode-web.css" />
</head>
<body>
<div id="content">
<h1 class="title"><span class='hebrew'>לימוד ערבית</span></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9dd2231">1. משאבים</a></li>
<li><a href="#orgbc9ffe5">2. הכתב הערבי</a></li>
<li><a href="#org4173300">3. ערבית מדוברת בניב של המזרח־הקרוב (ניב שָׁאמִי), <span class='ruqaa'>عامية شامية</span></a></li>
<li><a href="#org3fc1b96">4. <span class='hebrew'>ערבית ספרותית</span>, <span class='latin'>MSA</span>, <span class='ruqaa'>فصحة</span></a></li>
</ul>
</div>
</div>
<script src="https://mayer-goldberg.github.io/website/hebrew-support/gmayer-org-mode-web.js"></script>

<div id="outline-container-org9dd2231" class="outline-2">
<h2 id="org9dd2231"><span class="section-number-2">1</span> משאבים</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd93d04e" class="outline-3">
<h3 id="orgd93d04e"><span class="section-number-3">1.1</span> ספרים</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>הספרים של יוחנן אליחי
<ul class="org-ul">
<li>מה אני פחות אוהב בספרים של אליחי
<ul class="org-ul">
<li>אני פחות מתחבר לתעתיק שם, בעיקר משום שהוא מתעקש לבטא בתעתיק את השינויים הפונטיים שקורים בין מלים (כמו מושג הסנדהי, בסנסקריט), וזהיש כבר נקודה שממנה קשה לזהות מה המלים, וזה מאד מאט את הקריאה</li>
<li>התעתיק הספציפי שאליחי משתמש בו כולל דברים שלא קיימים לא במקלדת ולא בפונטים רגילים. למשל הוא ישים את הש<span class='shaddeh'>ד</span>ה מעל לאותיות, ישים את הנקודותים של התא־מרבוט<span class='marboutah'>ה</span> גם מעל האות <b>ה</b> וגם מעל לאות <b>ת</b> — שזה נוח בכתב, אבל סיוט בדפוס! ויש לו עוד כל מיני תוספות שאי אפשר לתמוך בהם מבלי להתאים פונט מיוחד ולתכנת תמיכה במקלדת…</li>
<li>מלכתחילה מאד התלהבתי מהטיעונים של אליחי בעד התעתיק שלו ונגד השימוש באותיות ערביות לרישום ערבית מדוברת. כיום אני מתרשם מהם הרבה פחות. החברים הערבים שלי לא מתקשים להשתמש באותיות הערביות ובתנועות הסטנדרטיות על מנת לכתוב בערבית מדוברת. ההתעסקות באלף־בית הערבי מועיל, ומאפשר לי לבנות כתב יד, להתרגל לקריאה ולכתיבה מהירים, להתרגל להקלדה, ויוצרים בסיס טוב ללימוד ערבית ספרותית בהמשך. אני בהחלט מעדיף כיום את השימוש באותיות ערביות עם ההרחבות הידועות הלקוחות מפרסית, על מנת לתמוך במלים מלועזית, בלהג העיראקי, וכו'.</li>
</ul></li>
<li>מה אני אוהב בספרים של אליחי
<ul class="org-ul">
<li>הספרים מפורטים מאד. אליחי היה לקסיקוגרף לפני ולפנים, וכלל אינפורמציה דקדוקית, אינפורמציה על להגים מקומיים, המוני דוגמאות לשימושים של מלים ולתופעות דקדוקיות, וכמובן לוח פעלים לערבית מדוברת. המלונים של אליחי ממש לא דומים לרוב המלונים שאפשר לקנות בארץ, שהם רשימות מלים הכתובות בשתי עמודות: אחת בעברית, והשניה בשפה אחרת, ללא כל אינפורמציה דקדוקית או אחרת.</li>
</ul></li>
<li>רשימת הספרים
<ul class="org-ul">
<li><a href="https://minerva-books.com/cart/">המלון העברי־ערבי</a>: ספר נפלא. הכריכה רכה, הדפוס קצת מיושן ופחות קריא, ואוצר המלים גם הספיק להתיישן טיפה. עדיין אי אפשר ללא הספר הזה!</li>
<li><a href="https://minerva-books.com/product/arabic-hebrew-complete-dictionary/">המלון הערבי־עברי</a>: ספר נפלא. כריכה קשה, הדפוס מודרני, הרבה יותר קריא וברור. מלון שימושי מאד.</li>
<li>החוברות <a href="https://minerva-books.com/product/%D7%9C%D7%93%D7%91%D7%A8-%D7%A2%D7%A8%D7%91%D7%99%D7%AA-%D7%A7%D7%95%D7%A8%D7%A1-%D7%9C%D7%9C%D7%99%D7%9E%D7%95%D7%93-%D7%A2%D7%A6%D7%9E%D7%99/">לדבר ערבית</a>: החוברות קריאות מאד. אבל אני מעדיף ספרי לימוד קצת יותר פורמאליים, כלומר לא רק עם דיאלוגים ורשימות מלים, אלא עם קצת יותר הסברים דקדוקיים.</li>
</ul></li>
</ul></li>
<li>המלון האטימולוגי לערבית מדוברת ולעברית מאת <b>אברהם שטאל</b> (כריכה קשה, שני כרכים): זה המלון השימושי ביותר שיש לי לערבית מדוברת. מפורט מאד, כולל המוני מלים ודוגמאות. כבר לא בדפוס, אבל אפשר עדיין למצוא אותו בחנויות לספרים משומשים. אין בו את כל העושר שיש במילונים של אליחי, ובכל זאת, יש לו אוצר מלים עדכני וגדול מאד.</li>
</ul>
</div>
</div>

<div id="outline-container-org96d465d" class="outline-3">
<h3 id="org96d465d"><span class="section-number-3">1.2</span> מלונים מקוונים</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://milon.madrasafree.com/">המלון המקוון של <b>מדרסה</b> לערבית מדוברת</a>. המלון פותח, מומש, ותוחזק על ידי <a href="https://rothfarb.info/"><b>רונן רוטפרב</b></a>. לאחר שנים שבהן ניהל את הפרוייקט לבדו, רונן העביר את הפרוייקט <a href="https://madrasafree.com/">לבית הספר <b>מדרסה</b> לערבית</a>, ואלו מתחזקים אותו כעת.</li>
<li><a href="https://www.livingarabic.com/en">פרוייקט <i><span class='latin'>Living Arabic</span></i>, <span class='naskh'>لُغَتُنَا</span></a>, על־ידי <a href="https://www.patreon.com/user?u=80648765"><b>חוסאם אבוזאהר</b></a>. הפרוייקט הזה כולל ערבית ספרותית, וגם להגים שונים של ערבית מדוברת. הפרוייקט חי, מתפתח, וכל הזמן נוספים לו חומרים חדשים. המלון כולל דוגמאות רבות לשימוש במלים בלהגים השונים.</li>
</ul>
</div>
</div>

<div id="outline-container-org0fe0588" class="outline-3">
<h3 id="org0fe0588"><span class="section-number-3">1.3</span> תרגומים אינטרלינאריים</h3>
</div>
</div>
<div id="outline-container-orgbc9ffe5" class="outline-2">
<h2 id="orgbc9ffe5"><span class="section-number-2">2</span> הכתב הערבי</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org73e872d" class="outline-3">
<h3 id="org73e872d"><span class="section-number-3">2.1</span> הסדר המלוני</h3>
</div>
<div id="outline-container-org3584be8" class="outline-3">
<h3 id="org3584be8"><span class="section-number-3">2.2</span> הקלדה עיוורת</h3>
</div>
<div id="outline-container-orgb8106c3" class="outline-3">
<h3 id="orgb8106c3"><span class="section-number-3">2.3</span> כתיבה תמה</h3>
</div>
</div>
<div id="outline-container-org4173300" class="outline-2">
<h2 id="org4173300"><span class="section-number-2">3</span> ערבית מדוברת בניב של המזרח־הקרוב (ניב שָׁאמִי), <span class='ruqaa'>عامية شامية</span></h2>
<div class="outline-text-2" id="text-3">
<p>
ערבית מדוברת של המזרח הקרוב היא אוסף של להגים המדוברים באיזור שהיסטורית נקרא בשם <b>סוריה הגדולה</b>, או שָׁאם (<span class='naskh'>شام</span>). האיזור כולל את לבנון, סוריה, ירדן, ישראל, הגדה המערבית, ורצועת עזה. מבחינה היסטורית, <b>סוריה הגדולה</b> כוללת גם את עיראק, אבל ערבית מדוברת עיראקית שונה מאד משאר הלהגים של <b>סוריה הגדולה</b>, וכולל השפעות רבות מפרסית ותורכית, ולכן מקובל שלא לכלול אותו בלהגים של <b>סוריה הגדולה</b>, אלא להתייחס אליו כלהג נפרד.
</p>
</div>

<div id="outline-container-org7807f22" class="outline-3">
<h3 id="org7807f22"><span class="section-number-3">3.1</span> Timeline</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<ol class="org-ol">
<li><a id="orgf5da94a"></a><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-09-21 Thu&gt;</span></span><br />
<div class="outline-text-4" id="text-3-1-1">
<p>
הכרטסת שלי כוללת 4261 כרטיסים. הוספתי 230+ כרטיסים מאז תחילת החודש. זה קצת מאכזב. קיוויתי שאוכל להוסיף מעל לאלף כרטיסים חדשים, ולא קרה. אני צריך להגביר את הקצב לפני תחילת הסמסטר.
</p>

<p>
יצרתי מקלדת וירטואלית לערבית עבור העורך שלי, אימקס. אני מאד אוהב את המקלדת הזאת משום שהיא מבוססת על מקלדת ה־<span class='latin'>Sholes, QWERTY</span> הסטנדרטית לאנגלית, שאני כבר מכיר היטב. היא תומכת היטב בניקוד, כולל בדברים "אקזוטיים" יותר כמו סימני ההפסקות בקריאה בקוראן, הארכת אותיות תוך שימוש ב־<span class='naskh'>تَطْويـــــــل</span>, וכו', והרחבות של האלף־בית הערבי (<span class='naskh'>پ، ڤ، گ</span>), ומנגישה סימנים מיוניקוד ערבי שבדרך כלל אינם נתמכים על ידי המקלדת הסטנדרטית, ולמרות כל זה, קל לכתוב בה מהר ומדוייק. הבעיה היא שהמקלדת הזאת לא נתמכת לא על ידי הטלפון שלי ולא על ידי הלפטופ עצמו, אלא קיימת אך ורק מתוך אימקס, כך שכשאני עובד על הלפטופ, התרגלתי לעשות <b>העתק־הדבק</b> לוואצאפ או לאתרים שונים או ב־<span class='latin'>shell</span>. אז כעת אני מקליד בשתי מקלדות ערביות שונות: הסטנדרטית [יחסית] שקיימת בלינוקס ובאנדרואיד, וזו שאני פיתחתי, שהיא נוחה מאד, שיש לה עקומת־למידה קטנה מאד ושקל להקליד בה מהר, אבל שזמינה רק באימקס… ובגלל שאני מקליד בשתי מקלדות, קשה לי לפתח מהירות ולצמצם טעויות… ולכן בצער רב אני מתחיל לרדת מהמקלדת המדהימה שפיתחתי, ומאמץ [בקור?] את המקלדת הסטנדרטית בערבית.
</p>

<p>
למדתי להקליד את התנועות הקצרות (ניקוד, <span class='naskh'>حَرَكات</span>) במקלדת הערבית הסטנדרטית. 
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org3fc1b96" class="outline-2">
<h2 id="org3fc1b96"><span class="section-number-2">4</span> <span class='hebrew'>ערבית ספרותית</span>, <span class='latin'>MSA</span>, <span class='ruqaa'>فصحة</span></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mayer Goldberg (<span class='hebrew'>מֵאִיר גּוֹלְדְּבֵּרְג</span>)</p>
<p class="date">Created: 2023-09-23 Sat 23:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
